{
    "<pad>": 0,
    "<sos>": 1,
    "<eos>": 2,
    "<unk>": 3,
    "[#Branch1]": 4,
    "[#Branch2]": 5,
    "[#C]": 6,
    "[#N+1]": 7,
    "[#N]": 8,
    "[-/Ring1]": 9,
    "[-/Ring2]": 10,
    "[-\\Ring1]": 11,
    "[/Br]": 12,
    "[/C@@H1]": 13,
    "[/C@@]": 14,
    "[/C@H1]": 15,
    "[/C@]": 16,
    "[/C]": 17,
    "[/Cl]": 18,
    "[/F]": 19,
    "[/N+1]": 20,
    "[/N-1]": 21,
    "[/NH1+1]": 22,
    "[/NH1-1]": 23,
    "[/NH1]": 24,
    "[/NH2+1]": 25,
    "[/N]": 26,
    "[/O+1]": 27,
    "[/O-1]": 28,
    "[/O]": 29,
    "[/S-1]": 30,
    "[/S@]": 31,
    "[/S]": 32,
    "[=Branch1]": 33,
    "[=Branch2]": 34,
    "[=C]": 35,
    "[=N+1]": 36,
    "[=N-1]": 37,
    "[=NH1+1]": 38,
    "[=NH2+1]": 39,
    "[=N]": 40,
    "[=O+1]": 41,
    "[=OH1+1]": 42,
    "[=O]": 43,
    "[=P@@]": 44,
    "[=P@]": 45,
    "[=PH2]": 46,
    "[=P]": 47,
    "[=Ring1]": 48,
    "[=Ring2]": 49,
    "[=S+1]": 50,
    "[=S@@]": 51,
    "[=S@]": 52,
    "[=SH1+1]": 53,
    "[=S]": 54,
    "[Br]": 55,
    "[Branch1]": 56,
    "[Branch2]": 57,
    "[C@@H1]": 58,
    "[C@@]": 59,
    "[C@H1]": 60,
    "[C@]": 61,
    "[CH1-1]": 62,
    "[CH2-1]": 63,
    "[C]": 64,
    "[Cl]": 65,
    "[F]": 66,
    "[I]": 67,
    "[N+1]": 68,
    "[N-1]": 69,
    "[NH1+1]": 70,
    "[NH1-1]": 71,
    "[NH1]": 72,
    "[NH2+1]": 73,
    "[NH3+1]": 74,
    "[N]": 75,
    "[O-1]": 76,
    "[O]": 77,
    "[P+1]": 78,
    "[P@@H1]": 79,
    "[P@@]": 80,
    "[P@]": 81,
    "[PH1+1]": 82,
    "[PH1]": 83,
    "[P]": 84,
    "[Ring1]": 85,
    "[Ring2]": 86,
    "[S+1]": 87,
    "[S-1]": 88,
    "[S@@+1]": 89,
    "[S@@]": 90,
    "[S@]": 91,
    "[S]": 92,
    "[\\Br]": 93,
    "[\\C@@H1]": 94,
    "[\\C@H1]": 95,
    "[\\C]": 96,
    "[\\Cl]": 97,
    "[\\F]": 98,
    "[\\I]": 99,
    "[\\N+1]": 100,
    "[\\N-1]": 101,
    "[\\NH1+1]": 102,
    "[\\NH1]": 103,
    "[\\NH2+1]": 104,
    "[\\N]": 105,
    "[\\O-1]": 106,
    "[\\O]": 107,
    "[\\S-1]": 108,
    "[\\S@]": 109,
    "[\\S]": 110
}